{
  "target": "2026-01-06",
  "holidays": [
    { "date": "2025-10-22", "name": "Diwali", "theme": "diwali" },
    { "date": "2025-11-01", "name": "Karnataka Rajyotsava", "theme": "karnataka" },
    { "date": "2025-12-25", "name": "Christmas", "theme": "christmas" },
    { "date": "2026-01-01", "name": "New Year", "theme": "newyear" }
  ],
  "quotes": [
    "Let your light shine softly, and the world will glow.",
    "Small steps every day lead to big journeys.",
    "Be gentle with yourself; you’re doing the best you can.",
    "Dream in pastels and wake in purpose.",
    "Carry love in your heart and kindness in your hands.",
    "Each sunrise is a new invitation to hope.",
    "Quiet confidence is the sweetest strength.",
    "You are growing. That is beautiful.",
    "Peace blooms where kindness is planted.",
    "The softest waves shape the strongest shores.",
    "Where you water it, love will flourish.",
    "Grace finds you when you breathe and begin again.",
    "Hold joy like a gentle candle in the wind.",
    "May your day be light and your heart lighter.",
    "Let today be lovely in small and certain ways.",
    "Even the quietest stars still shine.",
    "Choose calm. Choose care. Choose you.",
    "Your kindness is a garden—let it grow.",
    "Soft hearts carry the strongest courage.",
    "Let patience paint your path in color.",
    "The gentlest breeze can move mountains of worry.",
    "You are exactly where your growth begins.",
    "Wrap today in kindness and simple joys.",
    "Bloom slowly; beauty takes its time.",
    "You are allowed to rest and still rise.",
    "Hope whispers, even when the world is loud.",
    "Breathe in calm; breathe out doubt.",
    "Your pace is perfect for your path.",
    "Nourish your mind with quiet and care.",
    "Light finds a way—so will you.",
    "One kind thought can brighten the day.",
    "Trust the small, steady steps forward.",
    "Your presence is a gentle gift.",
    "Let gratitude color the moments in between.",
    "Where kindness lives, peace follows.",
    "Honor your progress, however soft it seems.",
    "There is calm waiting within you.",
    "Listen to the quiet; it knows the way.",
    "Let your courage be soft and sure.",
    "Today’s care builds tomorrow’s strength.",
    "Let gentle habits carry you forward.",
    "Give yourself permission to be new.",
    "Find beauty in the in-between.",
    "Let your joy be light but lasting.",
    "Soften the day with a smile.",
    "You are more capable than your doubts allow.",
    "Kindness is a language the heart remembers.",
    "Let hope take root and grow.",
    "Your light belongs here—let it glow."
  ],
  "quotesByDate": {
    "2025-10-20": "I choose you today, tomorrow, and every gentle morning after.",
    "2025-10-21": "Hold my hand—we’ll turn small steps into a lifetime.",
    "2025-10-22": "May our love glow like a thousand diyas—warm, kind, and bright.",
    "2025-10-23": "Your smile is my softest sunrise and safest place.",
    "2025-10-24": "Together is my favorite direction.",
    "2025-10-25": "We are two heartbeats learning the same song.",
    "2025-10-26": "Let tenderness lead us; it always knows the way.",
    "2025-10-27": "With you, even ordinary moments feel golden.",
    "2025-10-28": "Your laugh is the kind of magic I believe in.",
    "2025-10-29": "Side by side, we bloom in our own time.",
    "2025-10-30": "You are the calm in my courageous.",
    "2025-10-31": "Love is our daily choice—and I keep choosing you.",

    "2025-11-01": "May our colors always fly together—bold, bright, and free.",
    "2025-11-02": "Your presence turns silence into peace.",
    "2025-11-03": "We grow softer, stronger, and closer—beautifully.",
    "2025-11-04": "Every day with you is a quiet celebration.",
    "2025-11-05": "Let us be each other’s favorite hello and safest home.",
    "2025-11-06": "With you, hope feels like something I can hold.",
    "2025-11-07": "Our story is written in little kindnesses.",
    "2025-11-08": "You make courage feel effortless.",
    "2025-11-09": "Your love is my sweetest certainty.",
    "2025-11-10": "Let patience carry us to beautiful places.",
    "2025-11-11": "I see the best in me when I look at you.",
    "2025-11-12": "Your heart is a garden where mine finds rest.",
    "2025-11-13": "We’ll build a soft life, one gentle choice at a time.",
    "2025-11-14": "You’re my favorite part of every plan.",
    "2025-11-15": "We are proof that quiet love can be loud with joy.",
    "2025-11-16": "In your arms, everything unnecessary falls away.",
    "2025-11-17": "Our love is steady like a lighthouse—guiding, glowing, good.",
    "2025-11-18": "Every day, I fall for you in new, smaller ways.",
    "2025-11-19": "You are the wish I keep making and the answer I keep getting.",
    "2025-11-20": "We don’t rush; we grow.",
    "2025-11-21": "Your kindness fits me like a favorite sweater.",
    "2025-11-22": "I love the way you make time feel tender.",
    "2025-11-23": "Let’s gather simple joys and call it our treasure.",
    "2025-11-24": "You are the gentle forever I never knew I needed.",
    "2025-11-25": "With you, even the quiet feels full.",
    "2025-11-26": "Our love speaks softly but carries far.",
    "2025-11-27": "Two hearts, one rhythm—always learning, always kind.",
    "2025-11-28": "You make ordinary days worthy of memory.",
    "2025-11-29": "I fall in love with your mind, again and again.",
    "2025-11-30": "Thank you for being my safest yes.",

    "2025-12-01": "December with you feels like a warm light in winter.",
    "2025-12-02": "Let’s write our future in gentle ink.",
    "2025-12-03": "I choose to be your soft place to land.",
    "2025-12-04": "We turn little moments into lasting meaning.",
    "2025-12-05": "Your voice is the home my heart runs to.",
    "2025-12-06": "Every sunrise, the answer is still you.",
    "2025-12-07": "I love the way your kindness brightens rooms.",
    "2025-12-08": "Let us be gentle and brave in equal measure.",
    "2025-12-09": "You and me—perfectly imperfect and beautifully enough.",
    "2025-12-10": "I’ll meet you where you are, always.",
    "2025-12-11": "Your heart makes the world feel softer.",
    "2025-12-12": "We’re not in a hurry; we’re in love.",
    "2025-12-13": "You’re my favorite view and my favorite journey.",
    "2025-12-14": "I love the quiet confidence of us.",
    "2025-12-15": "Hand in hand, we make heavy things light.",
    "2025-12-16": "You are my always and my again.",
    "2025-12-17": "I like who I am when I’m loved by you.",
    "2025-12-18": "Let’s build a life that feels like a hug.",
    "2025-12-19": "Your love teaches me to rest and rise.",
    "2025-12-20": "We are a gentle team against a noisy world.",
    "2025-12-21": "You make my heart speak fluent hope.",
    "2025-12-22": "The way you care is my favorite miracle.",
    "2025-12-23": "You are the wish my soul whispers.",
    "2025-12-24": "I want a thousand small Christmasses with you.",
    "2025-12-25": "With you, love feels like home under every star.",
    "2025-12-26": "Your laughter is my daily medicine.",
    "2025-12-27": "Let’s keep choosing softness that stays.",
    "2025-12-28": "You light up the rooms I didn’t know were dark.",
    "2025-12-29": "I love the quiet ways you say ‘I’m here’.",
    "2025-12-30": "Our tomorrows look brighter because we’re together.",
    "2025-12-31": "I’ll kiss you into a kinder year.",

    "2026-01-01": "New year, same love—growing deeper, calmer, truer.",
    "2026-01-02": "Your hand in mine turns plans into promises.",
    "2026-01-03": "We begin again, as always, with love.",
    "2026-01-04": "Your heart is the map; I’m gladly guided.",
    "2026-01-05": "I love the life we’re softly building.",
    "2026-01-06": "Wherever we go next, we go together."
  }
}
